NACA0012/nacaAirfoil_n0012familyI.6.hex_gmesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (600 148.16 0);

boundaryField
{
     QUAD_bdy____6 // = inlet
    {
        type            supersonicFreestream;
        pInf            100000;
        TInf            300;
        UInf            (600 148.16 0);
        gamma           1.4;
        value           uniform (600 148.16 0);
    }

    QUAD_bdy____3 // = outlet1
    {
        type            inletOutlet;
        inletValue      uniform (600 148.16 0);
        value           uniform (600 148.16 0);
    }
    QUAD_bdy____4 //= outlet2
    {
        type            inletOutlet;
        inletValue      uniform (600 148.16 0);
        value           uniform (600 148.16 0);
    }
    QUAD_bdy____1 // = front
    {
        type            empty;
    }
    QUAD_bdy____2 // = back
    {
        type            empty;
    }
    QUAD_bdy____5 // = wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
