NACA0012/nacaAirfoil_n0012familyI.6.hex_gmesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    QUAD_bdy____1
    {
        type            empty;
    }
    QUAD_bdy____2
    {
        type            empty;
    }

    QUAD_bdy____3
    {
        type            waveTransmissive;
        field           p;
        gamma           1.3;
        fieldInf        100000;
        lInf            1;
        value           uniform 100000;
    }

    QUAD_bdy____4
    {
        type            waveTransmissive;
        field           p;
        gamma           1.3;
        fieldInf        100000;
        lInf            1;
        value           uniform 100000;
    }

    QUAD_bdy____5
    {
        type            zeroGradient;
    }

    QUAD_bdy____6
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
